app/controllers/api/entries_controller.rb

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def index
    feed = Feed.find(params[:feed_id])

SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    entry = Entry.find(params[:id])