app/controllers/api/feeds_controller.rb

  def create
    feed = Feed.find_or_create_by_url(feed_params[:url], current_user)
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 21 Nov 2014 00:57:28 UTC +00:00], ["title", "News"], ["updated_at", Fri, 21 Nov 2014 00:57:28 UTC +00:00], ["url", "http://www.npr.org/rss/rss.php?id=1001"], ["user_id", 4]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://www.npr.org/rss/rss.php?id=1001' AND "feeds"."user_id" = 3 LIMIT 1